{
  "1": {
    "content": "Q: Who was the only fictional character to feature in Time Magazine's 100 most important people of the 20th Century?\nA: BART SIMPSON\n\nQ: This quiz is printed on A4 paper which has a length of 297mm. How wide, in millimetres, is A4 paper?\nA: 210\n\nQ: How long do NFL football teams have to get a play off (the play clock)?\nA: 40 Seconds\n\nQ: John Chapter 11 Verse 35 is the shortest verse in the Bible. How many words make up the verse?\nA: Two\n\nQ: The 3rd of his vice presidents (after John Nance Garner and Henry Wallace), who took over the reins of power when FDR kicked off?\nA: Harry Truman\n\nQ: In April 1814 which King gained the French throne to begin the Bourbon Restoration?\nA: LOUIS XVIII\n\nQ: Which torture chamber was invented by George Orwell?\nA: Room 101\n\nQ: How many squares does a Rubik’s Cube have on each side?\nA: 9\n\nQ: The SS Titanic sank in which year?\nA: 1912\n\nQ: In 1984, in Bophal, India, there was a leak of 30 tons of methyl isocyanate, which resulted in the deaths of 25,000 people. What American chemical company owned the plant where the leak occurred?\nA: Union Carbide\n\nQ: Who had a No 1 in the 80's with Karma Chameleon\nA: Culture Club\n\nQ: Which Tim Burton film is the highest-grossing film of 2010 and, already, the fifth highest-grossing film of all time worldwide?\nA: 'ALICE IN WONDERLAND'\n\nQ: How many ‘E’ tiles are provided in a Scrabble game?\nA: 12\n\nQ: As at early 2015, how many Prime Ministers have served in Australia since 2013?\nA: 3\n\nQ: Which city in Georgia was burned by General Sherman during the American Civil War\nA: Atlanta\n\nQ: \"Which detective is the protagonist of the novels \"\"Dead Man's Folly\"\", \"\"Cards on the Table\"\" and \"\"Mrs McGinty's Dead\"\"?\"\nA: (Hercule) Poirot\n\nQ: How many feet are in a furlong?\nA: 660\n\nQ: In years and days, how old was Luigina Giavotti when she won a silver medal in gymnastics in 1928, and is still the youngest medal winner today?\nA: 11 years and 302 days\n\nQ: Which American naval destroyer was attacked in Aden in October 2000?\nA: U.S.S. COLE\n\nQ: From around 2566 B.C. to 1311 A.D. what was the world’s tallest building?\nA: Great Pyramid of Giza\n\nQ: Which British fashion designer was commissioned by Stanley Kubrick to design the costumes for the film ‘2001: A Space Odyssey’?\nA: Hardy Amies\n\nQ: What is commonly known as the 'sport of kings'?\nA: Horse Racing\n\nQ: Which is the largest city in Scandinavia by population ?\nA: STOCKHOLM\n\nQ: Cable News Network (CNN), the first channel to provide 24-hour television news coverage, was founded by Ted Turner in what year?\nA: 1980\n\n"
  }
}